import plotly.express as px


def Dataset_TreeMap():

    name = ["高铁数据可视化",
            "列车-全国-所有列车数据集",
            "列车-上海出发-列车详细数据集（爬虫-12306）",
            "车站-地理信息数据集（百度地图API）",
            "车站-通达度数据集",
            "列车编号",
            "起始站",
            "终点站",
            "车站信息",
            "时间信息",
            "价格信息",
            "距离信息(使用欧氏距离)",
            "起始站",
            "终点站",
            "出发站",
            "到达站",
            "出发时间",
            "到达时间",
            "持续时间",
            "一等座、二等座",
            "硬卧、软卧",
            "车站名",
            "经纬度",
            "多层级属地信息",
            "七大地理分区",
            "省",
            "市",
            "通达度评分(自构建指标)",
            "通达度层级(20%划分)",
            ]

    parent = ["",
              "高铁数据可视化",
              "高铁数据可视化",
              "高铁数据可视化",
              "高铁数据可视化",
              "列车-全国-所有列车数据集",
              "列车-全国-所有列车数据集",
              "列车-全国-所有列车数据集",
              "列车-上海出发-列车详细数据集（爬虫-12306）",
              "列车-上海出发-列车详细数据集（爬虫-12306）",
              "列车-上海出发-列车详细数据集（爬虫-12306）",
              "列车-上海出发-列车详细数据集（爬虫-12306）",
              "车站信息",
              "车站信息",
              "车站信息",
              "车站信息",
              "时间信息",
              "时间信息",
              "时间信息",
              "价格信息",
              "价格信息",
              "车站-地理信息数据集（百度地图API）",
              "车站-地理信息数据集（百度地图API）",
              "车站-地理信息数据集（百度地图API）",
              "多层级属地信息",
              "多层级属地信息",
              "多层级属地信息",
              "车站-通达度数据集",
              "车站-通达度数据集",
              ]

    fig = px.treemap(
        names=name,
        parents=parent,
        height=900)
    fig.update_traces(root_color="lightgrey")

    fig.update_layout(margin=dict(t=50, l=25, r=25, b=25))

    return fig


if __name__ == '__main__':
    Dataset_TreeMap().show()
